app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 3]]
---
	def show
		@tag = Tag.find(params[:id])

SELECT "tags".* FROM "tags"
---
	def index
		@tags = Tag.all